//Напишите программу, которая будет преобразовывать десятичное число в двоичное.

Console.Write("Введите число: ");
int dec = int.Parse(Console.ReadLine()); 

int binary = 0;

if (binary % 2 == 1); binary = 1;

for (int i = 0; dec == 0; i++)
{
    binary += dec/
}    